#pragma once

#include "..\Common.h"

struct RHeap {
	/*00*/ u32 unknow_0;
	/*01*/ u32 unknow_1;
	/*02*/ u32 unknow_2;
	/*03*/ u32 unknow_3;
	/*04*/ u32 unknow_4;
	/*05*/ u32 unknow_5;
	/*06*/ u32 unknow_6;
	/*07*/ u32 unknow_7;
	/*08*/ u32 unknow_8;
	/*09*/ u32 unknow_9;
	/*10*/ u32 unknow_10;
	/*11*/ u32 unknow_11;
	/*12*/ u32 unknow_12;
	/*13*/ u32 unknow_13;
	/*14*/ u32 iTestCodeRunning; //test it's actual size seems weird
	/*15*/ s32 iTestNestingLevel;
	/*16*/ s32 iTestNumAllocCells;
	/*17*/ u32 iTestAddress;
	/*18*/ u32 unknow_18;
	/*19*/ u32 unknow_19;
	/*20*/ u32 unknow_20;
	/*21*/ u32 unknow_21;
	/*22*/ u32 unknow_22;
	/*23*/ u32 unknow_23;
	/*24*/ u32 unknow_24;
	/*25*/ u32 unknow_25;
	/*26*/ u32 unknow_26;
	/*27*/ u32 unknow_27;
	/*28*/ u32 unknow_28;
	/*29*/ u32 unknow_29;
	/*30*/ u32 unknow_30;
	/*31*/ u32 unknow_31;
	/*32*/ u32 unknow_32;
	/*33*/ u32 unknow_33;
	//actual size unknow yet
};